In [1]:
#Actors and Directors Who Cooperated At Least Three Times
# Write your MySQL query statement below
SELECT
    actor_id,
    director_id
FROM
    ActorDirector
GROUP BY
    actor_id,
    director_id
HAVING
    COUNT(timestamp)>=3

IndentationError: unexpected indent (ipython-input-849824710.py, line 3)

In [2]:
#Fix Names in a Table
SELECT
    user_id,
    -- CONCAT joins the two parts:
    CONCAT(

        UCASE(SUBSTRING(name, 1, 1))
        LCASE(SUBSTRING(name, 2))
    ) AS name
FROM
    Users
ORDER BY
    user_id;

IndentationError: unexpected indent (ipython-input-3037854526.py, line 2)

In [ ]:
#Combine Two Tables
# Write your MySQL query statement below
SELECT
    P.firstName,
    P.lastName,
    A.city,
    A.state
FROM
    Person AS P
LEFT JOIN
    Address AS A
ON
    P.personId = A.personId;

In [ ]:
#Second Highest Salary
SELECT
    (SELECT DISTINCT salary
     FROM Employee
     ORDER BY salary DESC
     LIMIT 1 OFFSET 1
    ) AS SecondHighestSalary;

In [ ]:
#List the Products Ordered in a Period
# Write your MySQL query statement below
SELECT
    P.product_name,
    SUM(O.unit) AS unit
FROM
    Orders AS O
JOIN
    Products AS P
ON
    O.product_id = P.product_id
WHERE
    O.order_date >= '2020-02-01' AND O.order_date < '2020-03-01'
GROUP BY
    P.product_name
HAVING
    SUM(O.unit) >= 100;

In [ ]:
#Replace Employee ID With The Unique Identifier
# Write your MySQL query statement below
SELECT
    EUNI.unique_id,
    E.name
FROM
    Employees AS E
LEFT JOIN
    EmployeeUNI AS EUNI
ON
    E.id = EUNI.id;

In [3]:
# Gameplay Analysis

In [4]:
#Project Employees I
# Write your MySQL query statement below
SELECT
    P.project_id,
    ROUND(AVG(E.experience_years), 2) AS average_years
FROM
    Project AS P
JOIN
    Employee AS E
ON
    P.employee_id = E.employee_id
GROUP BY
    P.project_id;

In [ ]:
# Department Top Three Salaries